stevenj/avr-libc3/include/avr/io/attiny43u.h
/* Analog Comparator Interrupt Mode Select bits */
#define AC_ACIS_VAL_0x00_gc (0x00) /* Interrupt on Toggle */
#define AC_ACIS_VAL_0x01_gc (0x01) /* Reserved */
#define AC_ACIS_VAL_0x02_gc (0x02) /* Interrupt on Falling Edge */
#define AC_ACIS_VAL_0x03_gc (0x03) /* Interrupt on Rising Edge */


/* ADC 1 Digital input buffer disable */
#define AC_ADC1D_CLEAR_gc (0x00) /* ADC 1 Digital input buffer disable - CLEAR */
#define AC_ADC1D_SET_gc   (0x02) /* ADC 1 Digital input buffer disable - SET */


/* ADC 0 Digital input buffer disable */
#define AC_ADC0D_CLEAR_gc (0x00) /* ADC 0 Digital input buffer disable - CLEAR */
#define AC_ADC0D_SET_gc   (0x01) /* ADC 0 Digital input buffer disable - SET */


/*
--------------------------------------------------------------------------------
ADC - Analog-to-Digital Converter
--------------------------------------------------------------------------------
*/


/* Reference Selection Bit */
#define ADC_REFS_VAL_0x00_gc (0x00<<6) /* Vcc */
#define ADC_REFS_VAL_0x01_gc (0x01<<6) /* Internal 1.1V Voltage Reference */


/* Analog Channel Selection Bits */
#define ADC_ADMUX_MUX_gc(x) (x & 0x07)

/* ADC Enable */
#define ADC_ADEN_CLEAR_gc (0x00) /* ADC Enable - CLEAR */
#define ADC_ADEN_SET_gc   (0x80) /* ADC Enable - SET */


/* ADC Start Conversion */
#define ADC_ADSC_CLEAR_gc (0x00) /* ADC Start Conversion - CLEAR */
#define ADC_ADSC_SET_gc   (0x40) /* ADC Start Conversion - SET */


/* ADC Auto Trigger Enable */
#define ADC_ADATE_CLEAR_gc (0x00) /* ADC Auto Trigger Enable - CLEAR */
#define ADC_ADATE_SET_gc   (0x20) /* ADC Auto Trigger Enable - SET */


/* ADC Interrupt Flag */
#define ADC_ADIF_CLEAR_gc (0x00) /* ADC Interrupt Flag - CLEAR */
#define ADC_ADIF_SET_gc   (0x10) /* ADC Interrupt Flag - SET */


/* ADC Interrupt Enable */
#define ADC_ADIE_CLEAR_gc (0x00) /* ADC Interrupt Enable - CLEAR */
#define ADC_ADIE_SET_gc   (0x08) /* ADC Interrupt Enable - SET */


/* ADC  Prescaler Select Bits */
#define ADC_ADPS_VAL_0x00_gc (0x00) /* 2 */
#define ADC_ADPS_VAL_0x01_gc (0x01) /* 2 */
#define ADC_ADPS_VAL_0x02_gc (0x02) /* 4 */
#define ADC_ADPS_VAL_0x03_gc (0x03) /* 8 */
#define ADC_ADPS_VAL_0x04_gc (0x04) /* 16 */
#define ADC_ADPS_VAL_0x05_gc (0x05) /* 32 */
#define ADC_ADPS_VAL_0x06_gc (0x06) /* 64 */
#define ADC_ADPS_VAL_0x07_gc (0x07) /* 128 */


/* Boost Regulator Status Bit */
#define ADC_BVRON_CLEAR_gc (0x00) /* Boost Regulator Status Bit - CLEAR */
#define ADC_BVRON_SET_gc   (0x80) /* Boost Regulator Status Bit - SET */


/* Analog Comparator Multiplexer Enable */
#define ADC_ACME_CLEAR_gc (0x00) /* Analog Comparator Multiplexer Enable - CLEAR */
#define ADC_ACME_SET_gc   (0x40) /* Analog Comparator Multiplexer Enable - SET */


/* ADC Left Adjust Result */
#define ADC_ADLAR_CLEAR_gc (0x00) /* ADC Left Adjust Result - CLEAR */
#define ADC_ADLAR_SET_gc   (0x10) /* ADC Left Adjust Result - SET */


/* ADC Auto Trigger Source bits */
#define ADC_ADTS_VAL_0x00_gc (0x00) /* Free Running mode */
#define ADC_ADTS_VAL_0x01_gc (0x01) /* Analog Comparator */
#define ADC_ADTS_VAL_0x02_gc (0x02) /* External Interrupt Request 0 */
#define ADC_ADTS_VAL_0x03_gc (0x03) /* Timer/Counter0 Compare Match A */
#define ADC_ADTS_VAL_0x04_gc (0x04) /* Timer/Counter0 Overflow */
#define ADC_ADTS_VAL_0x05_gc (0x05) /* Timer/Counter1 Compare Match A */
#define ADC_ADTS_VAL_0x06_gc (0x06) /* Timer/Counter1 Overflow */
#define ADC_ADTS_VAL_0x07_gc (0x07) /* Timer/Counter1 Capture Match B */


/* Analog Comparator IO */
#define ADC_AIN1D_CLEAR_gc (0x00) /* Analog Comparator IO - CLEAR */
#define ADC_AIN1D_SET_gc   (0x20) /* Analog Comparator IO - SET */


/* Analog Comparator IO */
#define ADC_AIN0D_CLEAR_gc (0x00) /* Analog Comparator IO - CLEAR */
#define ADC_AIN0D_SET_gc   (0x10) /* Analog Comparator IO - SET */


/* ADC3 Digital Input Disable */
#define ADC_ADC3D_CLEAR_gc (0x00) /* ADC3 Digital Input Disable - CLEAR */
#define ADC_ADC3D_SET_gc   (0x08) /* ADC3 Digital Input Disable - SET */


/* ADC2 Digital Input Disable */
#define ADC_ADC2D_CLEAR_gc (0x00) /* ADC2 Digital Input Disable - CLEAR */
#define ADC_ADC2D_SET_gc   (0x04) /* ADC2 Digital Input Disable - SET */


/* ADC1 Digital Input Disable */
#define ADC_ADC1D_CLEAR_gc (0x00) /* ADC1 Digital Input Disable - CLEAR */
#define ADC_ADC1D_SET_gc   (0x02) /* ADC1 Digital Input Disable - SET */


/* ADC0 Digital Input Disable */
#define ADC_ADC0D_CLEAR_gc (0x00) /* ADC0 Digital Input Disable - CLEAR */
#define ADC_ADC0D_SET_gc   (0x01) /* ADC0 Digital Input Disable - SET */


/*
--------------------------------------------------------------------------------
EEPROM - EEPROM
--------------------------------------------------------------------------------
*/


/* EEPROM Programming Mode Bits */
#define EEPROM_EEPM_VAL_0x00_gc (0x00<<4) /* Erase and Write in one operation */
#define EEPROM_EEPM_VAL_0x01_gc (0x01<<4) /* Erase Only */
#define EEPROM_EEPM_VAL_0x02_gc (0x02<<4) /* Write Only */


/* EEPROM Ready Interrupt Enable */
#define EEPROM_EERIE_CLEAR_gc (0x00) /* EEPROM Ready Interrupt Enable - CLEAR */
#define EEPROM_EERIE_SET_gc   (0x08) /* EEPROM Ready Interrupt Enable - SET */


/* EEPROM Master Write Enable */
#define EEPROM_EEMPE_CLEAR_gc (0x00) /* EEPROM Master Write Enable - CLEAR */
#define EEPROM_EEMPE_SET_gc   (0x04) /* EEPROM Master Write Enable - SET */


/* EEPROM Write Enable */
#define EEPROM_EEPE_CLEAR_gc (0x00) /* EEPROM Write Enable - CLEAR */
#define EEPROM_EEPE_SET_gc   (0x02) /* EEPROM Write Enable - SET */


/* EEPROM Read Enable */
#define EEPROM_EERE_CLEAR_gc (0x00) /* EEPROM Read Enable - CLEAR */
#define EEPROM_EERE_SET_gc   (0x01) /* EEPROM Read Enable - SET */

#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


